Revit 2027 API
FabricationPartSizeMap Properties
The FabricationPartSizeMap type exposes the following members.
Properties
Name | Description
AllowMultipleServiceSizes |  State flag to allow multiple services to include the same size.
Depth |  The depth of the straight.
IsMappedProductList |  Are the mapped sizes for a product listed fabrication part.
IsProductList |  Are the sizes for a product listed fabrication part.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MappedDepth |  The mapped size for the depth of the straight.
MappedProfileType |  The mapped shape of the straight.
MappedServiceId |  The mapped service identifier of the straight.
MappedWidthDiameter |  The mapped size for the width or diameter of the straight.
PaletteId |  The palette identifier of the straight.
ProfileType |  The shape of the straight.
ServiceId |  The service identifier of the straight.
SizeString |  The size display string for the straight that can be used by the user interface.
WidthDiameter |  The width or diameter of the straight.
Top
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace